tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "awscli"
brew "bluetoothconnector"
brew "bundletool"
brew "ctags"
brew "direnv"
brew "fasd"
brew "fzf"
brew "gawk"
brew "git"
brew "git-delta"
brew "git-secrets"
brew "gnu-sed"
brew "gnu-tar"
brew "hexyl"
brew "jenv"
brew "jq"
brew "lftp"
brew "libimobiledevice"
brew "lsd"
brew "neovim"
brew "nodenv"
brew "poetry"
brew "pueue"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "rust"
brew "silicon"
brew "starship"
brew "switchaudio-osx"
brew "telnet"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "topgrade"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "yq"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "1password-cli"
cask "rectangle"
cask "adoptopenjdk8"
cask "font-cica"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-menlo-for-powerline"
cask "react-native-debugger"
cask "visual-studio-code"
