tap "adoptopenjdk/openjdk"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "shivammathur/php"
brew "openssl@1.1"
brew "awscli"
brew "bluetoothconnector"
brew "bundletool"
brew "bzip2"
brew "composer"
brew "ctags"
brew "direnv"
brew "fasd"
brew "fzf"
brew "gawk"
brew "git"
brew "git-delta"
brew "git-secrets"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "hexyl"
brew "jenv"
brew "jq"
brew "lftp"
brew "libimobiledevice"
brew "lsd"
brew "mas"
brew "mysql-client"
brew "neovim"
brew "nodenv"
brew "poetry"
brew "pueue"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "rust"
brew "silicon"
brew "starship"
brew "subversion"
brew "switchaudio-osx"
brew "telnet"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "topgrade"
brew "trash"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "wp-cli"
brew "yq"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "heroku/brew/heroku"
brew "shivammathur/php/php@7.3"
brew "shivammathur/php/php@7.4", link: true
cask "1password"
cask "1password-cli"
cask "adoptopenjdk11"
cask "adoptopenjdk8"
cask "alfred"
cask "android-studio"
cask "appcleaner"
cask "bettertouchtool"
cask "deepl"
cask "docker"
cask "drawio"
cask "figma"
cask "firefox"
cask "font-cica"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-menlo-for-powerline"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "karabiner-elements"
cask "obsidian"
cask "react-native-debugger"
cask "rectangle"
cask "sfdx"
cask "switchresx"
cask "visual-studio-code"
cask "zoom"
mas "Gapplin", id: 768053424
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "Marked 2", id: 890031187
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parallels Client", id: 600925318
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "WinArchiver Lite", id: 414855915
mas "Xcode", id: 497799835
