#Include functions.ahk

SetKeyDelay -1

;==================================================
; デフォルトショートカットの無効化
;==================================================
#F::Return
;!#F::Return
^#s::Return
#Space::Return


;==================================================
; EscでIMEをOFF 
;==================================================
~Esc::IME_SET(0)
~^[::IME_SET(0)


;==================================================
; 変換・ひらがな/カタカナでIMEをON (トグルしない) 
;==================================================
vk1C::IME_SET(1)
vkF2::IME_SET(1)
+vkF1::IME_SET(1)


;==================================================
; 無変換でIMEをOFF
;==================================================
vk1D::IME_SET(0)


;==================================================
; Altキーを利用した定義
; 無変換の方の設定を利用するためコメントアウト中
;==================================================
; !h::Send,{Left}         ; ←
; !j::Send,{Down}         ; →
; !k::Send,{Up}           ; ↑
; !l::Send,{Right}        ; ↓
; !m::Send,{Home}         ; Home
; !,::Send,{End}          ; End
; !i::Send,{AppsKey}      ; 右クリック


;==================================================
; 無変換キーを利用した定義
;==================================================
vk1D & h::Send,{Blind}{Left}         ; ←
vk1D & j::Send,{Blind}{Down}         ; →
vk1D & k::Send,{Blind}{Up}           ; ↑
vk1D & l::Send,{Blind}{Right}        ; ↓
vk1D & m::Send,{Blind}{Home}         ; Home
vk1D & ,::Send,{Blind}{End}          ; End
vk1D & i::Send,{AppsKey}             ; 右クリック

;==================================================
; よく使うアプリのショートカット (Runは別ウィンドウが起動するので利用しない)
; タスクトレイのピン留め順番で起動する
;==================================================
!f::Send #1                 ;Explorer
!c::Send #2                 ;Chrome
!e::Send #3                 ;Edge
!v::Send #4                 ;VSCode
!t::Send #5                 ;WezTerm
!o::Send #6                 ;Obsidian


;==================================================
; 画面サイズ変更
;==================================================
#Up::ResizeActiveWindows("U", 0.5)          ; Win+↑で上半分
#Down::ResizeActiveWindows("D", 0.5)        ; Win+↓で下半分
#Left::ResizeActiveWindows("L", 0.5)        ; Win+←で左半分
#Right::ResizeActiveWindows("R", 0.5)       ; Win+→で右半分
!#F::ResizeActiveWindows("F", 1.0)          ; Win+Alt+fでフルスクリーン
!#Left::ResizeActiveWindows("L", 0.3)       ; Win+Alt+←で左30%
!#Right::ResizeActiveWindows("R", 0.7)      ; Win+Alt+→で右70%


;==================================================
; ※ メモ ※
;   修飾キー
;   Ctrl  -> ^
;   Shift -> +
;   Alt   -> !
;   Win   -> #
;   無変換 -> vk1D &
;==================================================


;==================================================
; マウスのスクロールを反転
;==================================================
;WheelUp::
;  Send {WheelDown}
;  Return
;WheelDown::
;  Send {WheelUp}
;  Return